N = int(input())
signal = input()

number = [
    ['#','#','#','#','#','#','.','.','.','#','#','#','#','#','#'],  # 0
    ['#','#','#','#','#'],                                          # 1
    ['#','.','#','#','#','#','.','#','.','#','#','#','#','.','#'],  # 2
    ['#','.','#','.','#','#','.','#','.','#','#','#','#','#','#'],  # 3
    ['#','#','#','.','.','.','.','#','.','.','#','#','#','#','#'],  # 4
    ['#','#','#','.','#','#','.','#','.','#','#','.','#','#','#'],  # 5
    ['#','#','#','#','#','#','.','#','.','#','#','.','#','#','#'],  # 6
    ['#','.','.','.','.','#','.','.','.','.','#','#','#','#','#'],  # 7
    ['#','#','#','#','#','#','.','#','.','#','#','#','#','#','#'],  # 8
    ['#','#','#','.','#','#','.','#','.','#','#','#','#','#','#']   # 9
]

data = [[] for _ in range(5)]

for i in range(5):
    for j in range(i * (N // 5), (i + 1) * (N//5)):
        data[i].append(signal[j])

result = ''
tmp = []
for i in range(N // 5):
    for j in range(5):
        tmp.append(data[j][i])

    for j in range(len(number)):
        if tmp == ['.','.','.','.','.']:                    # 공백 없애기
            tmp = []

        # 1은 다른 숫자에 포함되는 곳이 많기 때문에 따로 처리
        if tmp == ['#','#','#','#','#']:                    # 1이 나왔을 때
            # 다른 숫자가 나왔을 때는 그 숫자를 result에 추가하고 리스트를 초기화하기 때문에
            # 첫번째 열에 1이 들어가는 0, 6, 8을 대비해서 따로 처리해주면 된다.
            if i < (N // 5) - 1 and data[0][i + 1] == '.':  # 1번째 행의 다음 열이 공백이면 1이라고 판단
                result += '1'
                tmp = []
            elif i == (N // 5) - 1:                         # 마지막 열이 1일 경우
                result += '1'
                tmp = []
            else:                                           # 1이 아니라고 판단되면 건너뛰기
                continue

        elif tmp == number[j]:                              # number 리스트에서 같은 리스트가 있다면
            result += str(j)                                # result에 number의 인덱스 추가
            tmp = []

print(result)


